# NextCurveType Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
HorizontalCurveEndpoint..::..NextCurveType Property
HorizontalCurveEndpoint Class See Also
---
The HorizontalCurveType of the curve which connects the endpoint to the next displayed curve. If this endpoint's Station equals DisplayedEndStation, returns Unknown curve type.
**Namespace:** Autodesk.Revit.DB.Infrastructure**Assembly:** Autodesk.CivilAlignments.DBApplication (in Autodesk.CivilAlignments.DBApplication.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2021.1
# Syntax
C#
---
```text
public HorizontalCurveType NextCurveType { get; internal set; }
```

Visual Basic
---
```text
Public Property NextCurveType As HorizontalCurveType
	Get
	Friend Set
```

Visual C++
---
```text
public:
property HorizontalCurveType NextCurveType {
	HorizontalCurveType get ();
	internal: void set (HorizontalCurveType value);
}
```

# See Also
HorizontalCurveEndpoint Class
Autodesk.Revit.DB.Infrastructure Namespace